# St7GetNumCombinedLSACombinations

Returns the number of linear load case combinations in the specified model for user-generated .LSA files.

long St7GetNumCombinedLSACombinations(long uID, long* NumCases)

Input Parameters

uID

Strand7 model file ID.

Output Parameters
NumCases

Number of linear load case combinations.

Strand7 API Manual